##  title: Global

##================================================##
##>>  Section 0: Global environment  <<##
##================================================##

##++++++++++++++++++++++++++++++++++++++++++++++++##
##>>  Sub-section 1: Setup  <<##
##++++++++++++++++++++++++++++++++++++++++++++++++##
source("R/package.R")

##++++++++++++++++++++++++++++++++++++++++++++++++##
##>>  Sub-section 2: UI helper  <<##
##++++++++++++++++++++++++++++++++++++++++++++++++##
source("R/helper_ui.R")
ref <- "出典: RESAS (地域経済分析システム) を加工して作成"
ver <- "ver: 0.0.0.9001"

##++++++++++++++++++++++++++++++++++++++++++++++++##
##>>  Sub-section 3: Server helper  <<##
##++++++++++++++++++++++++++++++++++++++++++++++++##
font_add_google("Noto Sans JP", "noto sans jp")
showtext_auto()
source("R/helper_server.R")

##++++++++++++++++++++++++++++++++++++++++++++++++##
##>>  Sub-section 4: Modules  <<##
##++++++++++++++++++++++++++++++++++++++++++++++++##
source("R/mod_output.R")

#<<  Population  >>#
list.files("R/Population") %>% 
  str_c("R/Population", ., sep = "/") %>% 
  map(source)

#<<  Town  >>#


#<<  Employment  >>#


##>>--------------END of Section 0--------------<<##
